app/controllers/administrator/banners_controller.rb

SELECT "banners".* FROM "banners"
---
  def index
    @banners = Banner.all

SELECT  "banners".* FROM "banners" WHERE "banners"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @banner = Banner.find(params[:id])

UPDATE "banners" SET "image" = ?, "updated_at" = ? WHERE "banners"."id" = ?  [["image", "_________________2015-04-08_09_14_06.png"], ["updated_at", "2015-07-27 13:51:20.464234"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @banner.update(banner_params)

SELECT  "banners".* FROM "banners" WHERE "banners"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_menu
      @banner = Banner.find(params[:id])