app/controllers/administrator/project_categories_controller.rb

SELECT  "project_categories".* FROM "project_categories" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "project_categories"
---
  def index
    @project_categories = ProjectCategory.all.paginate(:page => params[:page], :per_page => 10)

SELECT  "project_categories".* FROM "project_categories" WHERE "project_categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT "project_category_attacments".* FROM "project_category_attacments" WHERE "project_category_attacments"."project_category_id" = ?  [["project_category_id", 1]]
---
  def edit
    @project_category = ProjectCategory.find(params[:id])
    @project_category_attachments = ProjectCategoryAttacment.where(project_category_id: @project_category.id)