app/views/projects/search.html.erb

          <% if project.name.size > 38 %>
            <%= project.name.truncate(38) %>
---
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 8713]]