app/controllers/dynamic_project_pages_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."project_category_id" = ? LIMIT 36 OFFSET 0  [["project_category_id", 8]]
SELECT "project_categories".* FROM "project_categories"
---
  def show
    @projects = Project.all
    if @dynamic_project_page.query
       @projects = @projects.where(@dynamic_project_page.query)
    end

    if @dynamic_project_page.project_category_id
       @projects = @projects.where(project_category_id: @dynamic_project_page.project_category_id)
    end

    @projects = @projects.paginate(:page => params[:page], :per_page => 36)

SELECT  "dynamic_project_pages".* FROM "dynamic_project_pages" WHERE "dynamic_project_pages"."id" = ? LIMIT 1  [["id", 37]]
---
    def set_dynamic_project_page
      @dynamic_project_page = DynamicProjectPage.find(params[:id])