app/controllers/events_controller.rb

  def index
    @events = Event.all
    @page = StaticPage.where(descriptor: "events").first
---
SELECT "events".* FROM "events"
SELECT  "static_pages".* FROM "static_pages" WHERE "static_pages"."descriptor" = ?  ORDER BY "static_pages"."id" ASC LIMIT 1  [["descriptor", "events"]]