app/controllers/projects_controller.rb

SELECT "project_attacments".* FROM "project_attacments" WHERE "project_attacments"."project_id" = ?  [["project_id", 936]]
---
  def show
    @question = Question.new(params[:question])
    @project_attacments = ProjectAttacment.where(project_id: @project.id)

SELECT  "projects".* FROM "projects" LIMIT 36 OFFSET 0
SELECT COUNT(*) FROM "projects"
---
  def index
    @projects = Project.all.paginate(:page => params[:page], :per_page => 36)

DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 6728]]
SELECT "projects".* FROM "projects" WHERE "projects"."meta_title" = ?  [["meta_title", "this is demo"]]
---
  def remove_bad_sample
    Project.where(meta_title: "this is demo").destroy_all