app/controllers/project_categories_controller.rb

  def show
     @project_category_attachments = ProjectCategoryAttacment.where(project_category_id: @project_category.id)
---
SELECT "project_category_attacments".* FROM "project_category_attacments" WHERE "project_category_attacments"."project_category_id" = ?  [["project_category_id", 1]]

  def index
    @project_categories = ProjectCategory.all
    @page =  StaticPage.where(descriptor: "project_categories").first
---
SELECT "project_categories".* FROM "project_categories"
SELECT  "static_pages".* FROM "static_pages" WHERE "static_pages"."descriptor" = ?  ORDER BY "static_pages"."id" ASC LIMIT 1  [["descriptor", "project_categories"]]

    def set_project_category
      @project_category = ProjectCategory.find(params[:id])
---
SELECT  "project_categories".* FROM "project_categories" WHERE "project_categories"."id" = ? LIMIT 1  [["id", 1]]