app/controllers/questions_controller.rb

INSERT INTO "questions" ("name", "skype", "email", "phone", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "1"], ["skype", "4"], ["email", "2"], ["phone", "3"], ["message", "1234"], ["created_at", "2015-07-23 05:27:38.548770"], ["updated_at", "2015-07-23 05:27:38.548770"]]
---
  def create
    @question = Question.create(question_params)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 97]]
---
  def set_question
    @question = Question.find(params[:project_id])