app/controllers/reviews_controller.rb

  def index
    @reviews = Review.where(published: true).paginate(:page => params[:page], :per_page => 10)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."published" = 't' LIMIT 10 OFFSET 0