app/controllers/static_controller.rb

	def home
		@slider = Slider.where(descriptor: "main").first
		@projects = Project.where(elect: true).limit(7)
		@page = StaticPage.where(descriptor: "home").first
		@block2 = @page.site_variables.where(descriptor: "houses_in_turc").first
		@helpful_news = Post.where(post_category_id: 1, to_main_page: true)
		@helpful_posts = Post.where(post_category_id: 2, to_main_page: true)
		@events = Event.all.order(:date).limit(4)
---
SELECT  "sliders".* FROM "sliders" WHERE "sliders"."descriptor" = ?  ORDER BY "sliders"."id" ASC LIMIT 1  [["descriptor", "main"]]
SELECT  "projects".* FROM "projects" WHERE "projects"."elect" = 't' LIMIT 7
SELECT  "static_pages".* FROM "static_pages" WHERE "static_pages"."descriptor" = ?  ORDER BY "static_pages"."id" ASC LIMIT 1  [["descriptor", "home"]]
SELECT  "site_variables".* FROM "site_variables" WHERE "site_variables"."static_page_id" = ? AND "site_variables"."descriptor" = ?  ORDER BY "site_variables"."id" ASC LIMIT 1  [["static_page_id", 1], ["descriptor", "houses_in_turc"]]
SELECT "posts".* FROM "posts" WHERE "posts"."post_category_id" = ? AND "posts"."to_main_page" = 't'  [["post_category_id", 1]]
SELECT  "events".* FROM "events"  ORDER BY "events"."date" ASC LIMIT 4

	def company_info
		@question = Question.new(params[:question])
		@page = StaticPage.where(descriptor: "company_info").first
		@youtube_link = @page.site_variables.where(descriptor: "youtube_link").first
		@managers = Manager.where(company_info: true)
---
SELECT  "static_pages".* FROM "static_pages" WHERE "static_pages"."descriptor" = ?  ORDER BY "static_pages"."id" ASC LIMIT 1  [["descriptor", "company_info"]]
SELECT  "site_variables".* FROM "site_variables" WHERE "site_variables"."static_page_id" = ? AND "site_variables"."descriptor" = ?  ORDER BY "site_variables"."id" ASC LIMIT 1  [["static_page_id", 2], ["descriptor", "youtube_link"]]
SELECT "managers".* FROM "managers" WHERE "managers"."company_info" = 't'

	def partners
		 @question = Question.new(params[:question])
		@managers = Manager.where(elect: true)
---
SELECT "managers".* FROM "managers" WHERE "managers"."elect" = 't'

	def free_tour
		@question = Question.new(params[:question])
		@page = StaticPage.where(descriptor: "free_tour").first
---
SELECT  "static_pages".* FROM "static_pages" WHERE "static_pages"."descriptor" = ?  ORDER BY "static_pages"."id" ASC LIMIT 1  [["descriptor", "free_tour"]]

	def contacts
		@question = Question.new(params[:question])
		@page = StaticPage.where(descriptor: "page_contacts").first
---
SELECT  "static_pages".* FROM "static_pages" WHERE "static_pages"."descriptor" = ?  ORDER BY "static_pages"."id" ASC LIMIT 1  [["descriptor", "page_contacts"]]