app/controllers/static_pages_controller.rb

    def set_static_page
      @page = StaticPage.find(params[:id])
---
SELECT  "static_pages".* FROM "static_pages" WHERE "static_pages"."id" = ? LIMIT 1  [["id", 7]]